# -*- coding: utf-8 -*-
# Токен бота
TOKEN = '5862204233:AAG4npNHJbbx36q0qdYh0EE6qNJBYB6L8nA'

# Файл с конфигом для подключения к бд
config = 'config.ini'
# Конфиг базы для работы с винды
#config = 'config_c4_db_debag.ini'
# Конфиг базы для работы с винды на своем базе
#config = 'config_tel_debag.ini'

# нет 9, 25, 28, 29, 30, 31, 32, 33
genres_id = {
    "триллер": 1,
    "драма": 2,
    "криминал": 3,
    "мелодрама": 4,
    "детектив": 5,
    "фантастика": 6,
    "приключения": 7,
    "биография": 8,
    "вестерн": 10,
    "боевик": 11,
    "фэнтези": 12,
    "комедия": 13,
    "военный": 14,
    "история": 15,
    "музыка": 16,
    "ужасы": 17,
    "мультфильм": 18,
    "семейный": 19,
    "мюзикл": 20,
    "спорт": 21,
    "документальный": 22,
    "короткометражка": 23,
    "аниме": 24,
    "новости": 26,
    "концерт": 27,
    "детский": 33
}

genres_rating = {
    "триллер": [0, 0],
    "драма": [0, 0],
    "криминал": [0, 0],
    "мелодрама": [0, 0],
    "детектив": [0, 0],
    "фантастика": [0, 0],
    "приключения": [0, 0],
    "биография": [0, 0],
    "вестерн": [0, 0],
    "боевик": [0, 0],
    "фэнтези": [0, 0],
    "комедия": [0, 0],
    "военный": [0, 0],
    "история": [0, 0],
    "музыка": [0, 0],
    "ужасы": [0, 0],
    "мультфильм": [0, 0],
    "семейный": [0, 0],
    "мюзикл": [0, 0],
    "спорт": [0, 0],
    "документальный": [0, 0],
    "короткометражка": [0, 0],
    "аниме": [0, 0],
    "новости": [0, 0],
    "концерт": [0, 0],
    "детский": [0, 0]
}